In [10]:
# SQLite is a software where we can write SQL queries. It is a stand-alone DBMS. 
# It is preprable for small dbs and embedding systems. 

# SQLite has only 5 datatypes including
#     NULL: exists or not
#     INTEGER: a whole number
#     REAL: a decimal number
#     TEXT: texts
#     BLOB: stores as it is, i.e. image

In [1]:
import sqlite3

In [8]:
# connect to the database
conn = sqlite3.connect('customer.db')

In [9]:
# create a cursor
c = conn.cursor()

In [58]:
# create a table
c.execute("""
    CREATE TABLE IF NOT EXISTS customers(
        first_name text,
        last_name text,
        email text
    )
""")

In [59]:
# insert a record into the table
c.execute("""
    INSERT INTO customers VALUES('Mehedi', 'Bijoy', 'mhb64@gmail.com')
""")

In [18]:
# # insert multiple records into the table
# c.execute("""
#     INSERT INTO customers VALUES
#         ('Mehedi', 'Bijoy', 'mhb64@gmail.com'),
#         ('Mehedi', 'Bijoy', 'mhb64@gmail.com');
# """)

In [60]:
# insert multiple records into the table
many_customers = [
    ("Virat", "Kohli", "vk4574@adf.com"),
    ("Anushka", "Sharma", "ansh4@adf.com"),
    ("KL", "Rahul", "krahul@gmail.com"),
]

c.executemany("INSERT INTO customers VALUES (?, ?, ?)", many_customers)
print('Executed Successfully!')

Executed Successfully!

In [61]:
# query the database
c.execute("""
    SELECT * 
    FROM customers;
""")

# c.fetchone() # returns as tuple
# c.fetchmany(2) # returns as list: list of tuples
c.fetchall() # returns as list: list of tuples

[('Mehedi', 'Bijoy', 'mhb64@gmail.com'),
 ('Virat', 'Kohli', 'vk4574@adf.com'),
 ('Anushka', 'Sharma', 'ansh4@adf.com'),
 ('KL', 'Rahul', 'krahul@gmail.com')]

In [35]:
# fetch filtered records
c.execute("""
    SELECT * 
    FROM customers 
    WHERE last_name = 'Bijoy';
""")

# c.fetchone() # returns as tuple
# c.fetchmany(2) # returns as list: list of tuples
c.fetchall() # returns as list: list of tuples

[('Mehedi Hasan', 'Bijoy', 'mhb64@gmail.com'),
 ('Mehedi Hasan', 'Bijoy', 'mhb64@gmail.com')]

In [43]:
c.execute("SELECT rowid, * FROM customers WHERE rowid BETWEEN 1 AND 5")
c.fetchall()

[(1, 'Mehedi Hasan', 'Bijoy', 'mhb64@gmail.com'),
 (2, 'Mehedi Hasan', 'Bijoy', 'mhb64@gmail.com'),
 (3, 'Hasan', 'Sheikh', 'asdf64@gmail.com'),
 (4, 'Mehedi Hasan', 'Mehedi', 'fadfas@gmail.com'),
 (5, 'Virat', 'Kohli', 'vk4574@adf.com')]

In [40]:
# update records
c.execute("""
    UPDATE customers
        SET first_name = "Kohli's"
    WHERE last_name = 'Sharma';
""")
conn.commit()

c.execute("SELECT * FROM customers WHERE last_name = 'Sharma'")
c.fetchall()

[("Kohli's", 'Sharma', 'ansh4@adf.com')]

In [46]:
# delete records
c.execute("""
    DELETE FROM customers
    WHERE last_name in ('Bijoy', 'yojib');
""")

c.execute("SELECT rowid, * FROM customers")
c.fetchall()

[(3, 'Hasan', 'Sheikh', 'asdf64@gmail.com'),
 (4, 'Mehedi Hasan', 'Mehedi', 'fadfas@gmail.com'),
 (5, 'Virat', 'Kohli', 'vk4574@adf.com'),
 (6, "Kohli's", 'Sharma', 'ansh4@adf.com'),
 (7, 'KL', 'Rahul', 'krahul@gmail.com')]

In [50]:
# sort records: order by
c.execute("""
    SELECT rowid, * 
    FROM customers
    ORDER BY rowid DESC; 
""") # ASC or DESC

c.fetchall()

[(7, 'KL', 'Rahul', 'krahul@gmail.com'),
 (6, "Kohli's", 'Sharma', 'ansh4@adf.com'),
 (5, 'Virat', 'Kohli', 'vk4574@adf.com'),
 (4, 'Mehedi Hasan', 'Mehedi', 'fadfas@gmail.com'),
 (3, 'Hasan', 'Sheikh', 'asdf64@gmail.com')]

In [57]:
# drop a table
c.execute("""
    DROP TABLE IF EXISTS customers
""")

conn.commit()

# try to fetch all the records from the table
try:
    c.execute("SELECT * FROM customers")
    c.fetchall()
except:
    print("No Such Table Exists!")

No Such Table Exists!

In [16]:
# commit the comman
conn.commit()

In [ ]:
# close the connection
conn.close()